[
  {
    "id": 0,
    "name": "Stargate",
    "year": "1994",
    "image": "https://github.com/react-native-village/react-native-init/blob/master/stargate/images/Stargate.jpg",
    "info": "Stargate is a 1994 science fiction adventure film released through Metro-Goldwyn-Mayer (MGM) and Carolco Pictures. Written by Dean Devlin and Roland Emmerich, the film is the first release in the Stargate franchise. Directed by Emmerich, the film stars Kurt Russell, James Spader, Jaye Davidson, Alexis Cruz, Mili Avital, and Viveca Lindfors. The plot centers on the premise of a 'Stargate', an ancient ring-shaped device that creates a wormhole enabling travel to a similar device elsewhere in the universe. The film's central plot explores the theory of extraterrestrial beings having an influence upon human civilization."
  },
  {
    "id": 1,
    "name": "Stargate: The Ark of Truth",
    "year": "2008",
    "image": "https://github.com/react-native-village/react-native-init/blob/master/stargate/images/Stargate_The_Ark_of_Truth.jpg",
    "info": "Stargate: The Ark of Truth is a 2008 Canadian-American military science fiction film in the Stargate franchise, acting as a sequel to the television series Stargate SG-1. It is written and directed by Robert C. Cooper, produced by Cooper, John G. Lenic, and the series creator Brad Wright, and stars its regular cast. The film is the conclusion of the Ori arc, and picks up after the SG-1 series finale. However, it happens before the Stargate Atlantis third season finale."
  },
  {
    "id": 2,
    "name": "Stargate: Continuum",
    "year": "2008",
    "image": "https://github.com/react-native-village/react-native-init/blob/master/stargate/images/Stargate_Continuum.jpg",
    "info": "Stargate: Continuum is a 2008 Canadian-American military science fiction direct-to-video film in the Stargate franchise. It is the second sequel to television series Stargate SG-1 following The Ark of Truth. It is directed by Martin Wood, director and producer of many episodes of Stargate SG-1 and Stargate Atlantis, written by SG-1 and Atlantis creator Brad Wright, and produced by Wright and Ark of Truth director Robert C. Cooper."
  },
  {
    "id": 3,
    "name": "Stargate SG-1",
    "year": "1997",
    "image": "https://github.com/react-native-village/react-native-init/blob/master/stargate/images/Stargate_SG_1.jpg",
    "info": "Targate SG-1 (often abbreviated as SG-1) is a Canadian-American military science fiction adventure television series and part of Metro-Goldwyn-Mayers Stargate franchise. The show, created by Brad Wright and Jonathan Glassner, is based on the 1994 science fiction film Stargate by Dean Devlin and Roland Emmerich. The television series was filmed in and around the city of Vancouver, British Columbia, Canada. The series premiered on Showtime on July 27, 1997 and moved to the Sci Fi Channel on June 7, 2002; the final episode first aired on Sky1 on March 13, 2007."
  },
  {
    "id": 4,
    "name": "Stargate Atlantis",
    "year": "2004",
    "image": "https://github.com/react-native-village/react-native-init/blob/master/stargate/images/Stargate_Atlantis.jpg",
    "info": "Stargate Universe (often abbreviated as SGU) is a Canadian-American military science fiction television series and part of MGMs Stargate franchise. It follows the adventures of a present-day, multinational exploration team traveling on the Ancient spaceship Destiny several billion light years distant from the Milky Way Galaxy. They evacuated there and are now trying to figure out a way to return to Earth, while simultaneously trying to explore and to survive in their unknown area of the universe. The series, created by Brad Wright and Robert C. Cooper, premiered in the United States on Syfy on October 2, 2009. The series featured an ensemble cast and was primarily filmed in and around Vancouver, BC, Canada. A second season of 20 episodes was announced by Syfy in December 2009"
  },
  {
    "id": 5,
    "name": "Stargate Origins",
    "year": "2018",
    "image": "https://github.com/react-native-village/react-native-init/blob/master/stargate/images/Stargate_Origins.jpg",
    "info": "Stargate Origins (abbreviated as SGO) is an American science fiction adventure web series and part of Metro-Goldwyn-Mayers Stargate franchise. The program is based on the 1994 science fiction film Stargate by Dean Devlin and Roland Emmerich and its spin-off Stargate SG-1. It was announced on July 20, 2017 at the 2017 San Diego Comic Con as part of Stargate SG-1s 20th anniversary celebration. The series consists of 10 episodes, each 10 minutes in length, essentially a 10-episode feature length movie, and expands upon the existing mythology of the Stargate franchise. Stargate Origins premiered with 3 episodes on February 14, 2018 on MGM's 'Stargate Command' subscription service. A 104 minutes long ‘Feature Cut‘ titled Stargate Origins: Catherine was released on June 19, 2018 on digital retail outlets around the world in SD, HD, and 4K formats. ‘Feature Cut‘ additions include a fresh sound mix, enhanced visual effects, a new title sequence, and subtitles in 12 different languages."
  },
  {
    "id": 6,
    "name": "Stargate Infinity",
    "year": "2002",
    "image": "https://github.com/react-native-village/react-native-init/blob/master/stargate/images/Stargate_Infinity.jpg",
    "info": "Stargate Infinity (often abbreviated as SGI or just Infinity) is an American animated science fiction television series and part of Metro-Goldwyn-Mayers (MGM) Stargate franchise, but is not considered official Stargate canon. The show was created by Eric Lewald and Michael Maliani, as a spin-off series of Stargate SG-1, which was created by Brad Wright and Jonathan Glassner in 1997 after the release of the original film, Stargate (1994) by Dean Devlin and Roland Emmerich. The animation had a low viewership rating and poor reception; it was canceled after one season. It was co-produced by Metro-Goldwyn-Mayer Animation and DIC Entertainment (now DHX Media) and directed by Will Meugniot."
  }
]
